Repository: XianYuLauncher/XianYuLauncher
Catalog: XianYuLauncher/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn, zh_tw

# ErrorAnalysis_ContactAuthorButton.Content
source: Contact Author
zh_cn: 联系作者
zh_tw: 聯絡作者

# TutorialPage_BasicSettings_Title.Text
source: Basic Settings
zh_cn: 基础设置
zh_tw: 基礎設定

# TutorialPage_BrowseButton_Text.Text
source: Browse
zh_cn: 浏览
zh_tw: 瀏覽

# TutorialPage_JavaEnvironment_Title.Text
source: Java Environment
zh_cn: Java 环境
zh_tw: Java 環境

# TutorialPage_JavaNotFound_Hint.Text
source: If you don't see Java, try downloading, adding manually, or refreshing.
zh_cn: 如果您看不到 Java，请尝试下载、手动添加或刷新。
zh_tw: 如果您看不到 Java，請嘗試下載、手動新增或重新整理。

# TutorialPage_AdvancedOptions_Title.Text
source: Advanced Options
zh_cn: 高级选项
zh_tw: 高階選項

# TutorialPage_JavaSelectionMode_Title.Text
source: Java Selection Mode
zh_cn: Java 选择模式
zh_tw: Java 選擇模式

# TutorialPage_JavaSelectionMode_Auto.Content
source: Auto Select
zh_cn: 自动选择
zh_tw: 自動

# TutorialPage_JavaSelectionMode_Manual.Content
source: Manual Specify
zh_cn: 手动指定
zh_tw: 手動

# TutorialPage_AccountLogin_Title.Text
source: Account Login
zh_cn: 账户登录
zh_tw: 賬戶登入

# TutorialPage_LoginType_Microsoft.Content
source: Microsoft Login
zh_tw: 微軟登入

# TutorialPage_LoginType_Offline.Content
source: Offline Login
zh_tw: 離線登入

# TutorialPage_LoginType_External.Content
source: External Login
zh_cn: 外置登录
zh_tw: 外接登入

# TutorialPage_MicrosoftAccount_Label.Text
source: Microsoft Account
zh_cn: 微软账户
zh_tw: 微軟賬戶

# TutorialPage_BeforeLogin_Button.Text
source: Start Login
zh_cn: 开始登录
zh_tw: 開始登入

# TutorialPage_ExternalAccount_Label.Text
source: External Account
zh_cn: 外置账户
zh_tw: 外接賬戶

# TutorialPage_ExternalAuthServer.Header
source: Auth Server URL
zh_cn: 认证服务器 URL
zh_tw: 認證伺服器 URL

# TutorialPage_ExternalUsername.Header
source: Account/Email
zh_cn: 账号/邮箱
zh_tw: 賬戶/郵箱

# TutorialPage_ExternalUsername.PlaceholderText
source: Enter registered email
zh_cn: 请输入注册邮箱
zh_tw: 請輸入註冊郵箱

# TutorialPage_ExternalPassword.Header
source: Password
zh_cn: 密码
zh_tw: 密碼

# TutorialPage_ExternalPassword.PlaceholderText
source: Enter password
zh_cn: 请输入密码
zh_tw: 請輸入密碼

# TutorialPage_OfflineGameID.Header
source: Game ID
zh_cn: 游戏 ID
zh_tw: 遊戲 ID

# TutorialPage_OfflineGameID.PlaceholderText
source: Enter your nickname...
zh_cn: 请输入您的昵称...
zh_tw: 請輸入您的暱稱...

# TutorialPage_PreviousButton.Content
source: Previous
zh_cn: 上一步
zh_tw: 上一步

# TutorialPage_JavaPath.Header
source: Java Path
zh_cn: Java 路径
zh_tw: Java 路徑

# TutorialPage_JavaPath.PlaceholderText
source: Executable path...
zh_cn: 可执行文件路径...
zh_tw: 可執行檔案路徑...

# TutorialPage_NextButton.Content
source: Next
zh_cn: 下一步
zh_tw: 下一步

# TutorialPage_FinishButton.Content
source: Get Started
zh_cn: 开始使用
zh_tw: 開始使用

# TutorialPage_LoginStatus_VerifyingExternal
source: Verifying external account...
zh_cn: 正在验证外置登录账号...
zh_tw: 正在驗證外接登入賬戶...

# TutorialPage_LoginStatus_Cancelled
source: Login cancelled
zh_cn: 已取消登录
zh_tw: 已取消登入

# TutorialPage_ExternalLogin_FailedMessage
source: Verification failed, check credentials or server URL
zh_cn: 验证失败，请检查账号密码或服务器地址
zh_tw: 驗證失敗，請檢查賬戶密碼或伺服器地址

# TutorialPage_LoginError_Prefix
source: Login Error:
zh_cn: 登录出错:
zh_tw: 登入出錯:

# TutorialPage_LoginSuccess_Welcome
source: Welcome back, {0}!
zh_cn: 欢迎回来，{0}！
zh_tw: 歡迎回來，{0}！

# TutorialPage_FormIncomplete_Message
source: Please fill in all fields
zh_cn: 请填写所有字段
zh_tw: 請填寫所有欄位

# TutorialPage_GetCodeFailed
source: Failed to get login code
zh_cn: 获取登录代码失败
zh_tw: 獲取登入程式碼失敗

# TutorialPage_ExternalLoginButton_LoggedIn
source: Logged In
zh_cn: 已登录
zh_tw: 已登入

# TutorialPage_ExternalLoginButton_Login
source: Login External Account
zh_cn: 登录外置账号
zh_tw: 登入外接賬戶

# TutorialPage_InstalledJavaVersions.Text
source: Installed Java Versions
zh_cn: 已安装的 Java 版本
zh_tw: 已安裝的 Java 版本

# TutorialPage_DownloadJavaButton.ToolTipService.ToolTip
source: Download Java
zh_cn: 下载 Java
zh_tw: 下載 Java

# TutorialPage_AddJavaButton.ToolTipService.ToolTip
source: Add Manually
zh_cn: 手动添加
zh_tw: 手動新增

# TutorialPage_RefreshJavaButton.ToolTipService.ToolTip
source: Refresh List
zh_cn: 刷新列表
zh_tw: 重新整理列表

# TutorialPage_BrowseButton_Content.Content
source: Browse
zh_cn: 浏览
zh_tw: 瀏覽

# VersionManagerPage_SearchModPlaceholder.PlaceholderText
source: Search Mod...
zh_tw: 搜尋 Mod...

# VersionManagerPage_SearchShaderPlaceholder.PlaceholderText
source: Search Shaders...
zh_tw: 搜尋光影...

# VersionManagerPage_SearchResourcePackPlaceholder.PlaceholderText
source: Search Resource Packs...
zh_tw: 搜尋資源包...

# VersionManagerPage_SearchMapPlaceholder.PlaceholderText
source: Search Maps...
zh_tw: 搜尋地圖...

# VersionManagerPage_ModFilterAll.Content
source: All
zh_tw: 全部

# VersionManagerPage_ModFilterUpdatable.Content
source: Updatable
zh_tw: 可更新

# VersionManagerPage_ModFilterDuplicate.Content
source: Duplicate
zh_tw: 重複

# VersionManagerPage_ShaderFilterAll.Content
source: All
zh_tw: 全部

# VersionManagerPage_ShaderFilterUpdatable.Content
source: Updatable
zh_tw: 可更新

# VersionManagerPage_ShaderFilterDuplicate.Content
source: Duplicate
zh_tw: 重複

# VersionManagerPage_ResourcePackFilterAll.Content
source: All
zh_tw: 全部

# VersionManagerPage_ResourcePackFilterUpdatable.Content
source: Updatable
zh_tw: 可更新

# VersionManagerPage_ResourcePackFilterDuplicate.Content
source: Duplicate
zh_tw: 重複

# ModLoaderSelector_VersionNameDescription_Default
source: Custom version name. A version folder, jar file, and json file will be created with this name upon download.
zh_tw: 自定義版本名稱，下載時將使用此名稱建立版本資料夾、jar 檔案和 json 檔案。

# ModLoaderSelector_VersionNameError_Empty
source: Version name cannot be empty
zh_tw: 版本名稱不能為空

# ModLoaderSelector_VersionNameError_InvalidChars
source: Version name contains invalid characters
zh_tw: 版本名稱包含非法字元

# ModLoaderSelector_VersionNameError_ReservedDeviceName
source: Version name cannot use reserved Windows device names
zh_tw: 版本名稱不能使用 Windows 保留名稱

# ModLoaderSelector_VersionNameError_TrailingSpaceOrDot
source: Version name cannot end with a period or space
zh_tw: 版本名稱不能以句點或空格結尾

# ModLoaderSelector_VersionNameError_TooLong
source: Version name is too long. Please keep it within {0} characters
zh_tw: 版本名稱過長，請控制在 {0} 個字元以內

# ModLoaderSelector_VersionNameError_Exists
source: Version '{0}' already exists, please use a different name
zh_tw: 版本 '{0}' 已存在，請使用其他名稱

# Settings_LauncherAI.Description
source: Enable Launcher AI for conversations and in-app problem solving through a third-party AI service
zh_tw: 啟用後可在啟動器內使用第三方 AI 服務進行對話與問題處理

# LauncherAIPage_Subtitle.Text
source: Talk to the launcher agent to handle launches, versions, mods, and troubleshooting tasks.
zh_tw: 與啟動器 Agent 對話，處理啟動、版本、模組和排障任務

# LauncherAIPage_PopOutButton.ToolTipService.ToolTip
source: Open in a separate window
zh_tw: 在獨立視窗中開啟

# LauncherAIPanel_PopOutButton.ToolTipService.ToolTip
source: Open in a separate window
zh_tw: 在獨立視窗中開啟

# ErrorAnalysisChatPanel_AddImageButton.ToolTipService.ToolTip
source: Add image
zh_tw: 新增圖片

# ErrorAnalysisChatPanel_RemovePendingImageButton.ToolTipService.ToolTip
source: Remove image
zh_tw: 移除圖片

# Settings_AI_Disclaimer.Text
source: Launcher AI only provides the capability to access LLMs compatible with the OpenAI API specification. No AI services or accounts are provided within the software. Please confirm that relevant services are permitted in your region before use, and strictly abide by the terms of service, usage policies, and privacy rules of the selected AI provider; API Keys must be applied for and kept by yourself, and relevant costs and compliance responsibilities are borne by the user.
zh_tw: Launcher AI 僅提供接入 OpenAI Chat Completions API 規範的 LLM 的能力，軟體內不提供任何 AI 服務或賬戶。使用前請確認您所在地區允許使用相關服務，並嚴格遵守所選 AI 提供商的服務條款、使用政策與隱私規則；API Key 由您自行申請與保管，相關費用與合規責任由使用者自行承擔。

# Settings_AI_ApiEndpoint.Header
source: API Endpoint (Base URL)
zh_tw: API 端點 (Base URL)

# Settings_AI_ApiEndpoint.Description
source: OpenAI compatible API base URL
zh_tw: OpenAI 相容的 API 基礎 URL

# Settings_AI_ApiKey.Header
source: API Key
zh_tw: API 金鑰 (Key)

# Settings_AI_ApiKey.Description
source: Your API key
zh_tw: 您的 API 金鑰

# Settings_AI_ModelName.Header
source: Model Name
zh_tw: 模型名稱 (Model)

# Settings_AI_ModelName.Description
source: AI model to use
zh_tw: 使用的 AI 模型

# Settings_AI_SystemPrompt.Header
source: System Prompt
zh_tw: 系統提示

# Settings_AI_SystemPrompt.Description
source: Leave empty to use the built-in default prompt
zh_tw: 留空則使用內建預設提示詞

# Settings_AI_SystemPromptTextBox.PlaceholderText
source: Leave empty to use the built-in default system prompt
zh_tw: 留空則使用內建預設系統提示詞

# ResourceDownloadPage_FavoritesButton.ToolTipService.ToolTip
source: Drag resources here to bookmark
zh_tw: 拖拽資源到此處以收藏

# ResourceDownloadPage_FavoritesText.Text
source: Favorites
zh_tw: 收藏夾

# ResourceDownloadPage_FavoritesFlyoutTitle.Text
source: Favorite Resources
zh_tw: 收藏的資源

# ResourceDownloadPage_FavoritesEmpty.Text
source: No favorites yet
zh_tw: 暫無收藏

# ResourceDownloadPage_FavoritesDragHint.Text
source: Drag items to the Favorites button
zh_tw: 拖拽列表項到收藏夾按鈕

# ResourceDownloadPage_ImportFavoritesButton.ToolTipService.ToolTip
source: Import favorites to version
zh_tw: 匯入收藏到版本

# ResourceDownloadPage_RemoveFavoritesButton.ToolTipService.ToolTip
source: Remove selected items
zh_tw: 刪除選中項

# Settings_McModName
source: MCMOD
zh_tw: MC 百科

# Settings_McModSupportText
source: Provides Mod Data Translation
zh_tw: 提供 Mod 資料翻譯

# MaterialType_Motion
source: Aurora Motion
zh_tw: 流光

# Settings_OpenLogDirectoryDescription.Text
source: View launcher logs for troubleshooting
zh_tw: 檢視啟動器執行日誌，用於排查問題

# Settings_MoreTitle.Text
source: More
zh_tw: 更多

# VersionListPage_ErrorType
source: Error
zh_tw: 錯誤

# VersionListPage_MissingJsonFile
source: Missing version file
zh_tw: 缺少版本檔案

# ModDownloadDetailPage_DownloadSectionText_World
source: World Download
zh_tw: 世界下載

# ModDownloadDetailPage_VersionSelectionTip_World
source: Please verify if the world version matches the game version. It is recommended to perform a backup before importing.
zh_tw: 選擇遊戲版本

# Settings_GameSection.Text
source: Game
zh_tw: 遊戲

# Settings_PersonalizationSection.Text
source: Personalization
zh_tw: 個性化

# Settings_NetworkSection.Text
source: Network
zh_tw: 網路

# Settings_AboutSection.Text
source: About
zh_tw: 關於

# Settings_MinecraftPath.Header
source: Minecraft Game Directory
zh_tw: Minecraft 遊戲目錄

# Settings_MinecraftPath.Description
source: Manage game directories, double-click to switch
zh_tw: 管理遊戲目錄，雙擊列表項可快速切換

# Settings_JavaVersionManagement.Header
source: Java Version Management
zh_tw: Java 版本管理

# Settings_JavaVersionManagement.Description
source: Manage installed Java runtimes
zh_tw: 管理已安裝的 Java 執行時

# Settings_JavaSelectionMode.Header
source: Java Selection Mode
zh_tw: Java 選擇方式

# Settings_JavaSelectionMode.Description
source: Choose how Java is selected when launching games
zh_tw: 選擇啟動遊戲時使用的 Java 版本

# Settings_JavaPathLabel.Header
source: Java Path
zh_tw: Java 路徑

# Settings_JavaPathLabel.Description
source: Manually specify Java executable path
zh_tw: 手動指定 Java 可執行檔案路徑

# Settings_VersionIsolation.Header
source: Global Game Directory Isolation
zh_tw: 全域性版本隔離

# Settings_VersionIsolation.Description
source: Select the isolation mode for game directories
zh_tw: 選擇遊戲目錄的隔離模式

# Settings_RealTimeLogs.Header
source: Real-time Game Logs
zh_tw: 啟動遊戲實時日誌

# Settings_RealTimeLogs.Description
source: Automatically open real-time logs after game starts
zh_tw: 開啟後，啟動遊戲成功後會自動開啟實時日誌頁面

# Settings_Theme.Header
source: Theme
zh_tw: 主題

# Settings_Theme.Description
source: Choose the app appearance theme
zh_tw: 選擇應用的外觀主題

# Settings_WindowMaterial.Header
source: Window Material
zh_tw: 視窗材質

# Settings_WindowMaterial.Description
source: Choose window background effect
zh_tw: 選擇視窗背景效果

# Settings_BackgroundImage.Header
source: Background Image
zh_tw: 背景圖片

# Settings_BackgroundImage.Description
source: Select custom background image
zh_tw: 選擇自定義背景圖片

# Settings_Language.Header
source: Language
zh_tw: 語言

# Settings_Language.Description
source: Select app language, restart required after change
zh_tw: 選擇應用語言，更改後需要重啟應用

# Settings_FontFamily.Header
source: Font
zh_tw: 字型

# Settings_FontFamily.Description
source: Select app font, takes effect immediately
zh_tw: 選擇應用字型，更改後立即生效

# Settings_DownloadSource.Header
source: Game Download Source
zh_tw: 遊戲下載源

# Settings_DownloadSource.Description
source: Affects game resource download speed
zh_tw: 選擇下載源可以影響遊戲資源的下載速度

# Settings_SelectVersionListSource.Header
source: Version List Source
zh_tw: 版本列表源

# Settings_SelectVersionListSource.Description
source: Affects version list retrieval speed
zh_tw: 選擇版本列表源可以影響版本列表的獲取速度

# Settings_SelectCommunityDownloadSource.Header
source: Community Resource Source
zh_tw: 社群資源下載源

# Settings_SelectCommunityDownloadSource.Description
source: Source for Modrinth and CurseForge resources
zh_tw: 選擇 Modrinth 和 CurseForge 資源的下載源

# Settings_DownloadDependencies.Header
source: Download Dependencies
zh_tw: 下載前置 Mod

# Settings_DownloadDependencies.Description
source: Automatically download required dependency mods
zh_tw: 自動下載所需的前置 Mod

# Settings_HideSnapshotVersions.Header
source: Hide Snapshot Versions
zh_tw: Mod 隱藏快照版本

# Settings_HideSnapshotVersions.Description
source: Hide snapshots, pre-releases and release candidates
zh_tw: 隱藏 Mod 下載頁快照、預釋出版和候選版本

# Settings_DownloadQueueMaxConcurrentTasks.Header
source: Queue Concurrency
zh_tw: 下載任務併發數

# Settings_DownloadQueueMaxConcurrentTasks.Description
source: Number of download tasks that can run at the same time, default is 2
zh_tw: 同時執行的下載任務數量，預設 2

# Settings_DownloadThreadCount.Header
source: Download Threads
zh_tw: 下載執行緒數

# Settings_DownloadThreadCount.Description
source: Number of concurrent downloads, higher is faster
zh_tw: 同時下載資原始檔的數量，數值越大下載越快

# Settings_DownloadShardCount.Header
source: File Shard Count
zh_tw: 核心檔案分片數

# Settings_DownloadShardCount.Description
source: Number of concurrent shards for downloading large files
zh_tw: 單個大檔案的分片併發下載數量

# Settings_CacheManagement.Header
source: Cache Management
zh_tw: 快取管理

# Settings_CacheManagement.Description
source: Manage search results and image cache
zh_tw: 管理搜尋結果和圖片快取

# Settings_TotalCacheSize.Header
source: Total Cache Size
zh_tw: 總快取大小

# Settings_SearchCacheSize.Header
source: Search Results Cache
zh_tw: 搜尋結果快取

# Settings_ImageCacheSize.Header
source: Image Cache
zh_tw: 圖片快取

# Settings_VersionCacheSize.Header
source: Version List Cache
zh_tw: 版本列表快取

# Settings_Acknowledgments.Header
source: Acknowledgments
zh_tw: 鳴謝

# Settings_Acknowledgments.Description
source: Thanks to the following projects and contributors
zh_tw: 感謝以下專案和貢獻者

# Settings_About.Header
source: About
zh_tw: 關於

# Settings_UpdateSettings.Header
source: Update Settings
zh_tw: 更新設定

# Settings_UpdateSettings.Description
source: Configure automatic update checking
zh_tw: 配置自動檢查更新的方式

# Settings_AutoUpdateCheck.Header
source: Auto Check Updates
zh_tw: 自動檢查更新

# Settings_OpenLogDirectory.Header
source: Open Log Directory
zh_tw: 開啟日誌目錄

# Settings_OpenLogDirectory.Description
source: View launcher logs for troubleshooting
zh_tw: 檢視啟動器執行日誌，用於排查問題

# VersionManagerPage_MemorySettingMode.Text
source: Memory Setting Mode
zh_tw: 記憶體設定模式

# VersionManagerPage_MemoryFollowGlobal.Content
source: Follow Global Settings
zh_tw: 跟隨全域性設定

# VersionManagerPage_MemoryCustom.Content
source: Custom
zh_tw: 自定義

# VersionManagerPage_ResolutionSettingMode.Text
source: Resolution Setting Mode
zh_tw: 解析度設定模式

# VersionManagerPage_ResolutionFollowGlobal.Content
source: Follow Global Settings
zh_tw: 跟隨全域性設定

# VersionManagerPage_ResolutionCustom.Content
source: Custom
zh_tw: 自定義

# Settings_GlobalMemory.Header
source: Global Memory Allocation
zh_tw: 全域性記憶體分配

# Settings_GlobalMemory.Description
source: Set default memory allocation for all versions, can be overridden per version
zh_tw: 設定所有版本的預設記憶體分配，版本可單獨覆蓋

# Settings_GlobalAutoMemory.OnContent
source: Auto
zh_tw: 自動分配

# Settings_GlobalAutoMemory.OffContent
source: Manual
zh_tw: 手動設定

# Settings_GlobalInitialHeap.Header
source: Initial Heap Memory
zh_tw: 初始堆記憶體

# Settings_GlobalInitialHeap.Description
source: Initial memory allocated when game starts (GB)
zh_tw: 遊戲啟動時分配的初始記憶體（GB）

# Settings_GlobalMaxHeap.Header
source: Maximum Heap Memory
zh_tw: 最大堆記憶體

# Settings_GlobalMaxHeap.Description
source: Maximum memory the game can use (GB)
zh_tw: 遊戲執行時允許使用的最大記憶體（GB）

# Settings_GlobalResolution.Header
source: Global Launch Resolution
zh_tw: 全域性啟動解析度

# Settings_GlobalResolution.Description
source: Set default launch window size for all versions, can be overridden per version
zh_tw: 設定所有版本的預設啟動視窗大小，版本可單獨覆蓋

# Settings_GlobalWindowWidth.Header
source: Window Width
zh_tw: 視窗寬度

# Settings_GlobalWindowHeight.Header
source: Window Height
zh_tw: 視窗高度

# Settings_CurrentLoaderSection.Text
source: Current Loader
zh_tw: 當前載入器

# VersionManagerPage_CurrentVersionTitle.Text
source: Current Version
zh_tw: 當前版本

# VersionManagerPage_VersionSettingsSection.Text
source: Version Settings
zh_tw: 版本設定

# Settings_UseGlobalSettings.Header
source: Use Global Settings
zh_tw: 使用全域性設定

# Settings_UseGlobalSettings.Description
source: When enabled, this version will use configurations from global settings
zh_tw: 啟用後，此版本將使用全域性設定中的配置

# Settings_MemoryAllocation.Header
source: Memory Allocation
zh_tw: 記憶體分配

# Settings_MemoryAllocation.Description
source: Configure memory settings for game runtime
zh_tw: 設定遊戲執行時的記憶體配置

# Settings_AutoMemory.Header
source: Auto Allocate Memory
zh_tw: 自動分配記憶體

# Settings_InitialHeap.Header
source: Initial Heap Memory
zh_tw: 初始堆記憶體

# Settings_InitialHeap.Description
source: Initial memory allocated when game starts (GB)
zh_tw: 遊戲啟動時分配的初始記憶體（GB）

# Settings_MaxHeap.Header
source: Maximum Heap Memory
zh_tw: 最大堆記憶體

# Settings_MaxHeap.Description
source: Maximum memory allowed during game runtime (GB)
zh_tw: 遊戲執行時允許使用的最大記憶體（GB）

# Settings_JavaSettings.Header
source: Java Settings
zh_tw: Java 設定

# Settings_JavaSettings.Description
source: Configure Java runtime for the game
zh_tw: 配置遊戲使用的 Java 執行時

# VersionSettings_JavaPathCard.Header
source: Java Path
zh_tw: Java 路徑

# VersionSettings_JavaPathCard.Description
source: Specify Java executable path
zh_tw: 指定 Java 可執行檔案路徑

# VersionSettings_IconCard.Header
source: Version Icon
zh_tw: 版本圖示

# VersionSettings_IconCard.Description
source: Select or customize icon for current version
zh_tw: 為當前版本選擇或自定義圖示

# VersionIconPickerFlyoutContent_TitleTextBlock.Text
source: Select Version Icon
zh_tw: 選擇版本圖示

# VersionIconPickerFlyoutContent_BrowseCustomIconTextBlock.Text
source: Browse Custom Icon...
zh_tw: 瀏覽自定義圖示...

# VersionSettings_JavaPathBox.PlaceholderText
source: Select Java Path
zh_tw: 請選擇 Java 路徑

# Settings_Resolution.Header
source: Launch Resolution
zh_tw: 啟動解析度

# Settings_Resolution.Description
source: Set window size when game launches
zh_tw: 設定遊戲啟動時的視窗大小

# Settings_WindowWidth.Header
source: Window Width
zh_tw: 視窗寬度

# Settings_WindowHeight.Header
source: Window Height
zh_tw: 視窗高度

# Settings_CustomJvmArguments.Header
source: Custom JVM Arguments
zh_tw: 自定義 JVM 引數

# Settings_CustomJvmArguments.Description
source: Advanced option, one parameter per line or space-separated. Note: Duplicate JVM arguments will be automatically removed
zh_tw: 高階選項，每行一個引數或空格分隔。注意：重複的 JVM 引數會自動去除

# Settings_GlobalCustomJvmArguments.Header
source: Global Custom JVM Arguments
zh_tw: 全域性自定義 JVM 引數

# Settings_GlobalCustomJvmArguments.Description
source: Advanced option, one parameter per line or space-separated. Note: Duplicate JVM arguments will be automatically removed
zh_tw: 高階選項，每行一個引數或空格分隔。注意：重複的 JVM 引數會自動去除

# Settings_GlobalGarbageCollectorMode.Header
source: Global Garbage Collector
zh_tw: 全域性垃圾回收器

# Settings_GlobalGarbageCollectorMode.Description
source: Set the default garbage collector mode for all versions
zh_tw: 設定所有版本預設使用的垃圾回收器模式

# Settings_VersionGarbageCollectorMode.Header
source: Garbage Collector
zh_tw: 垃圾回收器

# Settings_VersionGarbageCollectorMode.Description
source: Set the garbage collector mode for this version
zh_tw: 設定此版本使用的垃圾回收器模式

# GarbageCollectorMode_Auto
source: Auto
zh_tw: 自動

# VersionManagement_Vanilla
source: Vanilla
zh_tw: 原版

# VersionManagerPage_ServerManagementTab.Text
source: Servers
zh_tw: 伺服器

# ServerListControl_SearchPlaceholder.PlaceholderText
source: Search servers
zh_tw: 搜尋伺服器

# ServerListControl_AddServerButton.ToolTipService.ToolTip
source: Add server
zh_tw: 新增伺服器

# ServerListControl_AddServerText.Text
source: Add
zh_tw: 新增

# ServerListControl_MenuItem_Launch.Text
source: Launch
zh_tw: 啟動

# ServerListControl_MenuItem_CreateShortcut.Text
source: Create Shortcut
zh_tw: 建立快捷方式

# ServerListControl_MenuItem_Delete.Text
source: Delete
zh_tw: 刪除

# ServerListControl_NoServersTitle.Text
source: No Servers Found
zh_tw: 暫無伺服器

# ServerListControl_NoServersDescription.Text
source: Add a server to start multiplayer game
zh_tw: 新增伺服器以開始多人遊戲

# ServerListControl_AddServerButtonEmpty.Content
source: Add Server
zh_tw: 新增伺服器

# SettingsPage_AfdianLink.Content
source: Sponsor
zh_tw: 贊助

# Settings_NavigationStyle.Header
source: Navigation Style
zh_tw: 導航欄風格

# Settings_NavigationStyle.Description
source: Adjust the navigation bar position
zh_tw: 調整導航欄的顯示位置

# Settings_NavigationStyle_Left.Content
source: Left
zh_tw: 側邊

# Settings_NavigationStyle_Top.Content
source: Top
zh_tw: 頂部

# Settings_AutoSelectFastestSource.Header
source: Auto Select Fastest Source
zh_tw: 自動選擇最優下載源

# Settings_AutoSelectFastestSource.Description
source: Automatically test and select the fastest download source
zh_tw: 自動測試並選擇最快的下載源

# Settings_SpeedTest.Header
source: Speed Test & Auto Select
zh_tw: 測速與自動選源

# Settings_SpeedTest.Description
source: Test and automatically select the fastest download source
zh_tw: 測試並自動選擇最快的下載源

# Settings_RunSpeedTest.Content
source: Speed Test
zh_tw: 測速

# Settings_SpeedTestAction.Header
source: Test Download Sources
zh_tw: 測試下載源速度

# Settings_LastSpeedTestTime.Header
source: Last Speed Test
zh_tw: 最後測速時間

# Settings_NextSpeedTestTime.Header
source: Next Speed Test
zh_tw: 下次測速時間

# Settings_FastestGameSource.Header
source: Fastest Game Source
zh_tw: 最快遊戲源

# Settings_FastestVersionManifestSource.Header
source: Fastest Version Manifest Source
zh_tw: 最快版本清單源

# Settings_FastestFileDownloadSource.Header
source: Fastest File Download Source
zh_tw: 最快檔案下載源

# Settings_FastestForgeSource.Header
source: Fastest Forge Source
zh_tw: 最快 Forge 源

# Settings_FastestFabricSource.Header
source: Fastest Fabric Source
zh_tw: 最快 Fabric 源

# Settings_FastestNeoForgeSource.Header
source: Fastest NeoForge Source
zh_tw: 最快 NeoForge 源

# Settings_FastestLiteLoaderSource.Header
source: Fastest LiteLoader Source
zh_tw: 最快 LiteLoader 源

# Settings_FastestQuiltSource.Header
source: Fastest Quilt Source
zh_tw: 最快 Quilt 源

# Settings_FastestLegacyFabricSource.Header
source: Fastest LegacyFabric Source
zh_tw: 最快 LegacyFabric 源

# Settings_FastestCleanroomSource.Header
source: Fastest Cleanroom Source
zh_tw: 最快 Cleanroom 源

# Settings_FastestOptifineSource.Header
source: Fastest Optifine Source
zh_tw: 最快 Optifine 源

# Settings_FastestModrinthSource.Header
source: Fastest Modrinth Source
zh_tw: 最快 Modrinth 源

# Settings_FastestCurseForgeSource.Header
source: Fastest CurseForge Source
zh_tw: 最快 CurseForge 源

# Settings_SpeedTest_NeverTested
source: Never tested
zh_tw: 從未測速

# Settings_SpeedTest_AboutToTest
source: About to test
zh_tw: 即將測速

# Settings_SpeedTest_TestFailed
source: Test failed
zh_tw: 測速失敗

# Settings_SpeedTest_HoursLater
source: About {0} hours later
zh_tw: 約 {0} 小時後

# Settings_SpeedTest_MinutesLater
source: About {0} minutes later
zh_tw: 約 {0} 分鐘後

# Settings_GameDownloadSource.Header
source: Game Resource Source
zh_tw: 遊戲資源下載源

# Settings_GameDownloadSource.Description
source: Download source for MC, ModLoader, and version list
zh_tw: MC 本體、ModLoader、版本列表的下載源

# Settings_GameDownloadSourceExpander.Header
source: Game Resource Sources
zh_tw: 遊戲資源下載源
